# Part I: Based on Feature Selection, Cleaning, and Preprocessing to Construct an Input from Data Source.

In [1]:
import pandas as pd
import numpy as np

In [8]:
df_customers=pd.read_csv("Desktop/STUDY MATERIAL/Tiet Subjects/Machine learning/Lab_Works/archive/AWCustomers.csv")
df_sales=pd.read_csv("Desktop/STUDY MATERIAL/Tiet Subjects/Machine learning/Lab_Works/archive/AWSales.csv")

In [5]:
df_customers.head()

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,21173,NaN,Chad,C,Yuan,NaN,7090 C. Mount Hood,NaN,Wollongong,New South Wales,...,Bachelors,Clerical,M,M,1,3,0,1,81916,2017-03-06
1,13249,NaN,Ryan,NaN,Perry,NaN,3651 Willow Lake Rd,NaN,Shawnee,British Columbia,...,Partial College,Clerical,M,M,1,2,1,2,81076,2017-03-06
2,29350,NaN,Julia,NaN,Thompson,NaN,1774 Tice Valley Blvd.,NaN,West Covina,California,...,Bachelors,Clerical,F,S,0,3,0,0,86387,2017-03-06
3,13503,NaN,Theodore,NaN,Gomez,NaN,2103 Baldwin Dr,NaN,Liverpool,England,...,Partial College,Skilled Manual,M,M,1,2,1,2,61481,2017-03-06
4,22803,NaN,Marshall,J,Shan,NaN,Am Gallberg 234,NaN,Werne,Nordrhein-Westfalen,...,Partial College,Skilled Manual,M,S,1,1,0,0,51804,2017-03-06

In [7]:
df_sales.head()

   CustomerID  BikeBuyer  AvgMonthSpend
0       21173          1          50.97
1       13249          1          53.11
2       29350          1          54.08
3       13503          1          56.93
4       22803          1          55.41

In [ ]:
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [12]:
df_customers.shape

(18361, 24)

In [14]:
df_customers.CustomerID.nunique() #checking unique values in customer id attribute

18355

In [15]:
df_customers.Title.isnull().sum() #checking null values in title attribute

18260

In [16]:
df_customers.Suffix.isnull().sum() #checking null values in title attribute

18358

In [17]:
df_customers.LastUpdated.nunique() #checking unique values in lastupdate attribute

2

In [18]:
df_customers.columns #Checking the names of each column

Index(['CustomerID', 'Title', 'FirstName', 'MiddleName', 'LastName', 'Suffix',
       'AddressLine1', 'AddressLine2', 'City', 'StateProvinceName',
       'CountryRegionName', 'PostalCode', 'PhoneNumber', 'BirthDate',
       'Education', 'Occupation', 'Gender', 'MaritalStatus', 'HomeOwnerFlag',
       'NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren',
       'YearlyIncome', 'LastUpdated'],
      dtype='object')

(a) Examine the values of each attribute and Select a set of attributes only that would affect to predict future bike buyers to create your input for data mining algorithms. Remove all the unnecessary attributes. (Select features just by analysis).
(b) Create a new Data Frame with the selected attributes only.

In [19]:
x = ['CustomerID','Title','MiddleName','Suffix','AddressLine2','PostalCode','AddressLine1','City','PhoneNumber','FirstName','LastName','LastUpdated']
df1 = df_customers.drop(x,axis = 1) # loading the data into df2 after dropping all the attributes

In [20]:
df1.head()

,StateProvinceName,CountryRegionName,BirthDate,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome
0,New South Wales,Australia,1987-11-13,Bachelors,Clerical,M,M,1,3,0,1,81916
1,British Columbia,Canada,1972-07-21,Partial College,Clerical,M,M,1,2,1,2,81076
2,California,United States,1985-11-09,Bachelors,Clerical,F,S,0,3,0,0,86387
3,England,United Kingdom,1977-10-18,Partial College,Skilled Manual,M,M,1,2,1,2,61481
4,Nordrhein-Westfalen,Germany,1975-02-05,Partial College,Skilled Manual,M,S,1,1,0,0,51804

In [25]:
df_customers.NumberCarsOwned.unique() # checking null values of numbercarsowned attribute

array([3, 2, 1, 0, 4, 5])

In [26]:
df_customers.HomeOwnerFlag.unique()

array([1, 0])

In [27]:
df_customers.Occupation.unique()

array(['Clerical', 'Skilled Manual', 'Manual', 'Management',
       'Professional'], dtype=object)

In [24]:
df1.drop_duplicates() # removing the redundant data

,StateProvinceName,CountryRegionName,BirthDate,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome
0,New South Wales,Australia,1987-11-13,Bachelors,Clerical,M,M,1,3,0,1,81916
1,British Columbia,Canada,1972-07-21,Partial College,Clerical,M,M,1,2,1,2,81076
2,California,United States,1985-11-09,Bachelors,Clerical,F,S,0,3,0,0,86387
3,England,United Kingdom,1977-10-18,Partial College,Skilled Manual,M,M,1,2,1,2,61481
4,Nordrhein-Westfalen,Germany,1975-02-05,Partial College,Skilled Manual,M,S,1,1,0,0,51804
...,...,...,...,...,...,...,...,...,...,...,...,...
18356,California,United States,1990-11-11,Graduate Degree,Skilled Manual,F,M,0,1,0,2,52953
18357,New South Wales,Australia,1992-10-13,Bachelors,Skilled Manual,F,S,0,2,0,0,60992
18358,Oregon,United States,1983-11-24,Partial College,Skilled Manual,F,S,0,2,0,0,51859
18359,British Columbia,Canada,1995-06-15,High School,Clerical,F,S,0,0,0,0,87177
18360,California,United States,1986-03-26,Graduate Degree,Professional,F,M,1,2,0,0,136856

In [28]:
df1.shape # after removing redundant data

(18361, 12)

In [29]:
df1.head()

,StateProvinceName,CountryRegionName,BirthDate,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome
0,New South Wales,Australia,1987-11-13,Bachelors,Clerical,M,M,1,3,0,1,81916
1,British Columbia,Canada,1972-07-21,Partial College,Clerical,M,M,1,2,1,2,81076
2,California,United States,1985-11-09,Bachelors,Clerical,F,S,0,3,0,0,86387
3,England,United Kingdom,1977-10-18,Partial College,Skilled Manual,M,M,1,2,1,2,61481
4,Nordrhein-Westfalen,Germany,1975-02-05,Partial College,Skilled Manual,M,S,1,1,0,0,51804

Part II: Data Preprocessing and Transformation Depending on the data type of each attribute, transform each object from your preprocessed data. Use all the data rows (~= 18000 rows) with the selected features as input to apply all the tasks below, do not perform each task on the smaller data set that you got from your random sampling result.

(a) Handling Null values
(b) Normalization
(c) Discretization (Binning) on Continuous attributes or Categorical Attributes with too many different
values
(d) Standardization/Normalization
(e) Binarization (One Hot Encoding)

In [31]:
df1.isnull().sum()

StateProvinceName       0
CountryRegionName       0
BirthDate               0
Education               0
Occupation              0
Gender                  0
MaritalStatus           0
HomeOwnerFlag           0
NumberCarsOwned         0
NumberChildrenAtHome    0
TotalChildren           0
YearlyIncome            0
dtype: int64

In [32]:
from scipy.stats import zscore

In [33]:
df1['numbercarsowned '] = zscore(df1['NumberCarsOwned'])
df1['NumberChildrenathome'] = zscore(df1['NumberChildrenAtHome'])
df1['totalChildren'] = zscore(df1['TotalChildren'])
df1['yearlyincome '] = zscore(df1['YearlyIncome'])

In [34]:
df1.head()

,StateProvinceName,CountryRegionName,BirthDate,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,numbercarsowned,NumberChildrenathome,totalChildren,yearlyincome
0,New South Wales,Australia,1987-11-13,Bachelors,Clerical,M,M,1,3,0,1,81916,1.892524,-0.594371,0.161342,0.298555
1,British Columbia,Canada,1972-07-21,Partial College,Clerical,M,M,1,2,1,2,81076,0.798389,1.163279,1.239753,0.271180
2,California,United States,1985-11-09,Bachelors,Clerical,F,S,0,3,0,0,86387,1.892524,-0.594371,-0.917069,0.444261
3,England,United Kingdom,1977-10-18,Partial College,Skilled Manual,M,M,1,2,1,2,61481,0.798389,1.163279,1.239753,-0.367401
4,Nordrhein-Westfalen,Germany,1975-02-05,Partial College,Skilled Manual,M,S,1,1,0,0,51804,-0.295746,-0.594371,-0.917069,-0.682765

In [35]:
X = ['NumberCarsOwned','TotalChildren','YearlyIncome','NumberChildrenAtHome']
df2 = df1.drop(X,axis = 1)

In [36]:
df2.head()

,StateProvinceName,CountryRegionName,BirthDate,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,numbercarsowned,NumberChildrenathome,totalChildren,yearlyincome
0,New South Wales,Australia,1987-11-13,Bachelors,Clerical,M,M,1,1.892524,-0.594371,0.161342,0.298555
1,British Columbia,Canada,1972-07-21,Partial College,Clerical,M,M,1,0.798389,1.163279,1.239753,0.271180
2,California,United States,1985-11-09,Bachelors,Clerical,F,S,0,1.892524,-0.594371,-0.917069,0.444261
3,England,United Kingdom,1977-10-18,Partial College,Skilled Manual,M,M,1,0.798389,1.163279,1.239753,-0.367401
4,Nordrhein-Westfalen,Germany,1975-02-05,Partial College,Skilled Manual,M,S,1,-0.295746,-0.594371,-0.917069,-0.682765

In [37]:
df2['Gender'] = df2['Gender'].apply(lambda x : 0 if x == 'M' else 1)
df2['MaritalStatus'] = df2['MaritalStatus'].apply(lambda x : 0 if x == 'M' else 1)

In [38]:
df2.head()

,StateProvinceName,CountryRegionName,BirthDate,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,numbercarsowned,NumberChildrenathome,totalChildren,yearlyincome
0,New South Wales,Australia,1987-11-13,Bachelors,Clerical,0,0,1,1.892524,-0.594371,0.161342,0.298555
1,British Columbia,Canada,1972-07-21,Partial College,Clerical,0,0,1,0.798389,1.163279,1.239753,0.271180
2,California,United States,1985-11-09,Bachelors,Clerical,1,1,0,1.892524,-0.594371,-0.917069,0.444261
3,England,United Kingdom,1977-10-18,Partial College,Skilled Manual,0,0,1,0.798389,1.163279,1.239753,-0.367401
4,Nordrhein-Westfalen,Germany,1975-02-05,Partial College,Skilled Manual,0,1,1,-0.295746,-0.594371,-0.917069,-0.682765

In [39]:
df2.Education.unique()

array(['Bachelors', 'Partial College', 'High School',
       'Partial High School', 'Graduate Degree'], dtype=object)

In [40]:
def edu(x):
    if x=='Bachelors':
        x= 3
    elif x == 'Graduate Degree':
        x = 3
    elif x=='Partial College':
        x= 2 
    elif x=='High School':
        x= 1 
    else:
        x= 0
    return x

In [41]:
df2['Education'] = df2['Education'].apply(edu)

In [42]:
df2.head()

,StateProvinceName,CountryRegionName,BirthDate,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,numbercarsowned,NumberChildrenathome,totalChildren,yearlyincome
0,New South Wales,Australia,1987-11-13,3,Clerical,0,0,1,1.892524,-0.594371,0.161342,0.298555
1,British Columbia,Canada,1972-07-21,2,Clerical,0,0,1,0.798389,1.163279,1.239753,0.271180
2,California,United States,1985-11-09,3,Clerical,1,1,0,1.892524,-0.594371,-0.917069,0.444261
3,England,United Kingdom,1977-10-18,2,Skilled Manual,0,0,1,0.798389,1.163279,1.239753,-0.367401
4,Nordrhein-Westfalen,Germany,1975-02-05,2,Skilled Manual,0,1,1,-0.295746,-0.594371,-0.917069,-0.682765

In [43]:
dummies = pd.get_dummies(df2.Occupation)
dummies1 = pd.get_dummies(df2.CountryRegionName)
dummies2 = pd.get_dummies(df2.StateProvinceName)

In [44]:
dummies

       Clerical  Management  Manual  Professional  Skilled Manual
0             1           0       0             0               0
1             1           0       0             0               0
2             1           0       0             0               0
3             0           0       0             0               1
4             0           0       0             0               1
...         ...         ...     ...           ...             ...
18356         0           0       0             0               1
18357         0           0       0             0               1
18358         0           0       0             0               1
18359         1           0       0             0               0
18360         0           0       0             1               0

[18361 rows x 5 columns]

In [47]:
dummies1

       Australia  Canada  France  Germany  United Kingdom  United States
0              1       0       0        0               0              0
1              0       1       0        0               0              0
2              0       0       0        0               0              1
3              0       0       0        0               1              0
4              0       0       0        1               0              0
...          ...     ...     ...      ...             ...            ...
18356          0       0       0        0               0              1
18357          1       0       0        0               0              0
18358          0       0       0        0               0              1
18359          0       1       0        0               0              0
18360          0       0       0        0               0              1

[18361 rows x 6 columns]

In [48]:
dummies2

,Alabama,Alberta,Arizona,Bayern,Brandenburg,British Columbia,California,Charente-Maritime,England,Essonne,...,Tasmania,Texas,Utah,Val d'Oise,Val de Marne,Victoria,Virginia,Washington,Wyoming,Yveline
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18356,0,0,0,0,0,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
18357,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
18358,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
18359,0,0,0,0,0,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
18360,0,0,0,0,0,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [49]:
df3 = pd.concat([df2,dummies.drop('Skilled Manual',axis='columns'),dummies1.drop('United States',axis='columns'),dummies2.drop('Yveline',axis='columns')],axis='columns')
df3.head()

,StateProvinceName,CountryRegionName,BirthDate,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,numbercarsowned,NumberChildrenathome,...,South Carolina,Tasmania,Texas,Utah,Val d'Oise,Val de Marne,Victoria,Virginia,Washington,Wyoming
0,New South Wales,Australia,1987-11-13,3,Clerical,0,0,1,1.892524,-0.594371,...,0,0,0,0,0,0,0,0,0,0
1,British Columbia,Canada,1972-07-21,2,Clerical,0,0,1,0.798389,1.163279,...,0,0,0,0,0,0,0,0,0,0
2,California,United States,1985-11-09,3,Clerical,1,1,0,1.892524,-0.594371,...,0,0,0,0,0,0,0,0,0,0
3,England,United Kingdom,1977-10-18,2,Skilled Manual,0,0,1,0.798389,1.163279,...,0,0,0,0,0,0,0,0,0,0
4,Nordrhein-Westfalen,Germany,1975-02-05,2,Skilled Manual,0,1,1,-0.295746,-0.594371,...,0,0,0,0,0,0,0,0,0,0

In [50]:
df4 = df3.drop(['StateProvinceName','CountryRegionName','Occupation'],axis = 1)

In [51]:
df4.head()

,BirthDate,Education,Gender,MaritalStatus,HomeOwnerFlag,numbercarsowned,NumberChildrenathome,totalChildren,yearlyincome,Clerical,...,South Carolina,Tasmania,Texas,Utah,Val d'Oise,Val de Marne,Victoria,Virginia,Washington,Wyoming
0,1987-11-13,3,0,0,1,1.892524,-0.594371,0.161342,0.298555,1,...,0,0,0,0,0,0,0,0,0,0
1,1972-07-21,2,0,0,1,0.798389,1.163279,1.239753,0.271180,1,...,0,0,0,0,0,0,0,0,0,0
2,1985-11-09,3,1,1,0,1.892524,-0.594371,-0.917069,0.444261,1,...,0,0,0,0,0,0,0,0,0,0
3,1977-10-18,2,0,0,1,0.798389,1.163279,1.239753,-0.367401,0,...,0,0,0,0,0,0,0,0,0,0
4,1975-02-05,2,0,1,1,-0.295746,-0.594371,-0.917069,-0.682765,0,...,0,0,0,0,0,0,0,0,0,0

In [52]:
df4['age'] = df2['BirthDate'].apply(lambda x : (2000 - float(x.split('-')[0]) + 24))

In [53]:
df4 = df4.drop(['BirthDate'],axis = 1)

In [54]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18361 entries, 0 to 18360
Data columns (total 71 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Education             18361 non-null  int64
 1   Gender                18361 non-null  int64
 2   MaritalStatus         18361 non-null  int64
 3   HomeOwnerFlag         18361 non-null  int64
 4   numbercarsowned       18361 non-null  float64
 5   NumberChildrenathome  18361 non-null  float64
 6   totalChildren         18361 non-null  float64
 7   yearlyincome          18361 non-null  float64
 8   Clerical              18361 non-null  uint8
 9   Management            18361 non-null  uint8
 10  Manual                18361 non-null  uint8
 11  Professional          18361 non-null  uint8
 12  Australia             18361 non-null  uint8
 13  Canada                18361 non-null  uint8
 14  France                18361 non-null  uint8
 15  Germany               18361 non-null  uint8
 16  United Kingdom        18361 non-null  uint8
 17  Alabama               18361 non-null  uint8
 18  Alberta               18361 non-null  uint8
 19  Arizona               18361 non-null  uint8
 20  Bayern                18361 non-null  uint8
 21  Brandenburg           18361 non-null  uint8
 22  British Columbia      18361 non-null  uint8
 23  California            18361 non-null  uint8
 24  Charente-Maritime     18361 non-null  uint8
 25  England               18361 non-null  uint8
 26  Essonne               18361 non-null  uint8
 27  Florida               18361 non-null  uint8
 28  Garonne (Haute)       18361 non-null  uint8
 29  Georgia               18361 non-null  uint8
 30  Hamburg               18361 non-null  uint8
 31  Hauts de Seine        18361 non-null  uint8
 32  Hessen                18361 non-null  uint8
 33  Illinois              18361 non-null  uint8
 34  Kentucky              18361 non-null  uint8
 35  Loir et Cher          18361 non-null  uint8
 36  Loiret                18361 non-null  uint8
 37  Maryland              18361 non-null  uint8
 38  Massachusetts         18361 non-null  uint8
 39  Minnesota             18361 non-null  uint8
 40  Mississippi           18361 non-null  uint8
 41  Missouri              18361 non-null  uint8
 42  Montana               18361 non-null  uint8
 43  Moselle               18361 non-null  uint8
 44  New South Wales       18361 non-null  uint8
 45  New York              18361 non-null  uint8
 46  Nord                  18361 non-null  uint8
 47  Nordrhein-Westfalen   18361 non-null  uint8
 48  North Carolina        18361 non-null  uint8
 49  Ohio                  18361 non-null  uint8
 50  Ontario               18361 non-null  uint8
 51  Oregon                18361 non-null  uint8
 52  Pas de Calais         18361 non-null  uint8
 53  Queensland            18361 non-null  uint8
 54  Saarland              18361 non-null  uint8
 55  Seine (Paris)         18361 non-null  uint8
 56  Seine Saint Denis     18361 non-null  uint8
 57  Seine et Marne        18361 non-null  uint8
 58  Somme                 18361 non-null  uint8
 59  South Australia       18361 non-null  uint8
 60  South Carolina        18361 non-null  uint8
 61  Tasmania              18361 non-null  uint8
 62  Texas                 18361 non-null  uint8
 63  Utah                  18361 non-null  uint8
 64  Val d'Oise            18361 non-null  uint8
 65  Val de Marne          18361 non-null  uint8
 66  Victoria              18361 non-null  uint8
 67  Virginia              18361 non-null  uint8
 68  Washington            18361 non-null  uint8
 69  Wyoming               18361 non-null  uint8
 70  age                   18361 non-null  float64
dtypes: float64(5), int64(4), uint8(62)
memory usage: 2.3 MB

In [55]:
df4.head()

,Education,Gender,MaritalStatus,HomeOwnerFlag,numbercarsowned,NumberChildrenathome,totalChildren,yearlyincome,Clerical,Management,...,Tasmania,Texas,Utah,Val d'Oise,Val de Marne,Victoria,Virginia,Washington,Wyoming,age
0,3,0,0,1,1.892524,-0.594371,0.161342,0.298555,1,0,...,0,0,0,0,0,0,0,0,0,37.0
1,2,0,0,1,0.798389,1.163279,1.239753,0.271180,1,0,...,0,0,0,0,0,0,0,0,0,52.0
2,3,1,1,0,1.892524,-0.594371,-0.917069,0.444261,1,0,...,0,0,0,0,0,0,0,0,0,39.0
3,2,0,0,1,0.798389,1.163279,1.239753,-0.367401,0,0,...,0,0,0,0,0,0,0,0,0,47.0
4,2,0,1,1,-0.295746,-0.594371,-0.917069,-0.682765,0,0,...,0,0,0,0,0,0,0,0,0,49.0

In [56]:
df4.age.min()

24.0

In [57]:
df4['age'] = df4['age'].apply(lambda x : (x-df4.age.min())/(df4.age.max() - df4.age.min()))

In [58]:
df4.head()

,Education,Gender,MaritalStatus,HomeOwnerFlag,numbercarsowned,NumberChildrenathome,totalChildren,yearlyincome,Clerical,Management,...,Tasmania,Texas,Utah,Val d'Oise,Val de Marne,Victoria,Virginia,Washington,Wyoming,age
0,3,0,0,1,1.892524,-0.594371,0.161342,0.298555,1,0,...,0,0,0,0,0,0,0,0,0,0.185714
1,2,0,0,1,0.798389,1.163279,1.239753,0.271180,1,0,...,0,0,0,0,0,0,0,0,0,0.400000
2,3,1,1,0,1.892524,-0.594371,-0.917069,0.444261,1,0,...,0,0,0,0,0,0,0,0,0,0.214286
3,2,0,0,1,0.798389,1.163279,1.239753,-0.367401,0,0,...,0,0,0,0,0,0,0,0,0,0.328571
4,2,0,1,1,-0.295746,-0.594371,-0.917069,-0.682765,0,0,...,0,0,0,0,0,0,0,0,0,0.357143

In [59]:
from sklearn.metrics import jaccard_score

Part III: Calculating Proximity /Correlation Analysis of two features
Make sure each attribute is transformed in a same scale for numeric attributes and Binarization for each
nominal attribute, and each discretized numeric attribute to standardization. Make sure to apply a correct
similarity measure for nominal (one hot encoding)/binary attributes and numeric attributes respectively.
(a) Calculate Similarity in Simple Matching, Jaccard Similarity, and Cosine Similarity between two
following objects of your transformed input data.
(b) Calculate Correlation between two features Commute Distance and Yearly Income

In [60]:
correlations = df4.corr(method = 'pearson')

In [61]:
correlations

,Education,Gender,MaritalStatus,HomeOwnerFlag,numbercarsowned,NumberChildrenathome,totalChildren,yearlyincome,Clerical,Management,...,Tasmania,Texas,Utah,Val d'Oise,Val de Marne,Victoria,Virginia,Washington,Wyoming,age
Education,1.000000,0.010499,-0.103141,0.150378,0.211594,0.053917,0.083252,0.456230,0.083513,0.253639,...,0.017735,-0.009174,0.009401,-0.022404,-0.030615,0.026280,-0.008331,0.016947,0.009401,0.031672
Gender,0.010499,1.000000,0.042809,-0.009935,-0.003541,-0.014645,-0.030360,0.000354,0.000735,0.013094,...,-0.007066,0.007552,-0.010317,0.005864,0.000469,-0.014384,-0.007295,0.000025,0.000121,0.002823
MaritalStatus,-0.103141,0.042809,1.000000,-0.442841,-0.051823,-0.471534,-0.750911,-0.048784,-0.001439,-0.037294,...,0.001280,-0.006170,0.011348,0.006096,0.003389,-0.002234,0.008024,-0.021952,-0.009599,-0.198326
HomeOwnerFlag,0.150378,-0.009935,-0.442841,1.000000,0.209787,0.368459,0.578197,0.356243,0.040706,0.190383,...,0.002797,0.004220,-0.013070,-0.000878,-0.011940,-0.005626,0.005894,0.033265,0.008335,0.643048
numbercarsowned,0.211594,-0.003541,-0.051823,0.209787,1.000000,0.020393,0.030430,0.477300,0.183281,0.242365,...,0.006021,-0.008403,-0.003087,0.001315,-0.004587,0.003526,0.005892,0.019383,0.008333,0.041978
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Victoria,0.026280,-0.014384,-0.002234,-0.005626,0.003526,-0.007861,-0.018332,0.001621,0.005242,0.002535,...,-0.017107,-0.003330,-0.002354,-0.009125,-0.009125,1.000000,-0.001665,-0.084382,-0.002354,-0.026076
Virginia,-0.008331,-0.007295,0.008024,0.005894,0.005892,-0.004387,-0.006768,0.003142,0.013022,-0.003169,...,-0.000560,-0.000109,-0.000077,-0.000299,-0.000299,-0.001665,1.000000,-0.002761,-0.000077,0.000376
Washington,0.016947,0.000025,-0.021952,0.033265,0.019383,0.009854,0.031540,0.017467,0.020892,-0.002220,...,-0.028370,-0.005522,-0.003904,-0.015133,-0.015133,-0.084382,-0.002761,1.000000,-0.003904,0.031318
Wyoming,0.009401,0.000121,-0.009599,0.008335,0.008333,-0.006204,0.001684,0.020859,-0.005916,-0.004481,...,-0.000792,-0.000154,-0.000109,-0.000422,-0.000422,-0.002354,-0.000077,-0.003904,1.000000,-0.008284
age,0.031672,0.002823,-0.198326,0.643048,0.041978,0.326531,0.548502,0.026744,-0.004177,0.010383,...,-0.015724,0.004032,-0.007356,-0.001417,-0.000099,-0.026076,0.000376,0.031318,-0.008284,1.000000